Documents/ДанныеДляРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДанныеДляРасчетаЗарплаты</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоказателей</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОкончания</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВЧасах</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксТарифнаяСтавка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксОтработанноеВремя</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксЗначение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасценкиРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РасценкиРаботСотрудников</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расценка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВыработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВыработкаСотрудников</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКТУ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТарифныеСтавки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтработанноеВремя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работник</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДанныеДляРасчетаЗарплаты/Ext/ObjectModule.bsl
&Вместо("ОбработкаЗаполнения")
Процедура Расш_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнениеКладовщиком") Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		ВыработкаСотрудников = ДанныеЗаполнения.ВыработкаСотрудников;
		РаботникиТЧ          = ДанныеЗаполнения.РаботникиТЧ;
		
		ПолучитьДанныеДляРасчетаЗарплаты(ВыработкаСотрудников, РаботникиТЧ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДляРасчетаЗарплаты(ВыработкаСотрудников, РаботникиТЧ)     
			
	Запрос = Новый Запрос;
	Запрос.Текст =  
	
	"ВЫБРАТЬ
	|	ВидыРабот.ВидРабот КАК ВидРабот,
	|	ВидыРабот.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ВидыРабот
	|ИЗ
	|	Документ.ВыработкаСотрудников.ВидыРабот КАК ВидыРабот
	|ГДЕ
	|	ВидыРабот.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА НЕ ВидыРабот.ВидРабот.Наименование ПОДОБНО &ВысшийСорт
	|				ТОГДА ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасценкиРаботСотрудниковСрезПоследних.ВидРабот КАК ВидРабот,
	|	РасценкиРаботСотрудниковСрезПоследних.Расценка КАК Расценка,
	|	ВТ_ВидыРабот.Количество КАК ОбъемВыполненныхРабот,
	|	-ВТ_ВидыРабот.Количество * РасценкиРаботСотрудниковСрезПоследних.Расценка КАК Сумма
	|ИЗ
	|	ВТ_ВидыРабот КАК ВТ_ВидыРабот,
	|	РегистрСведений.РасценкиРаботСотрудников.СрезПоследних(
	|			,
	|			ВидРабот В
	|				(ВЫБРАТЬ
	|					ВТ_ВидыРабот.ВидРабот
	|				ИЗ
	|					ВТ_ВидыРабот)) КАК РасценкиРаботСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", ВыработкаСотрудников);
	Запрос.УстановитьПараметр("ВысшийСорт", "%в/с%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыполненныеРаботы.Загрузить(РезультатЗапроса.Выгрузить());  
	
	ТаблицаРаботники = РаботникиТЧ.Выгрузить();
	ТаблицаРаботники.Колонки.Сотрудник.Имя = "Объект";
	ТаблицаРаботники.Колонки.КТУ.Имя = "Коэффициент";
	
	ЗначенияПоказателей.Загрузить(ТаблицаРаботники);	
	РаспределитьСтоимостьРаботПоСотрудникам(); 
	
КонецПроцедуры      

&НаСервере
Процедура РаспределитьСтоимостьРаботПоСотрудникам(ОтменятьИсправления = Ложь)
	
	УчитыватьКоэффициенты        = Ложь;
	УчитыватьТарифныеСтавки      = Ложь;
	УчитыватьОтработанноеВремя   = Ложь;
	РаспределятьСуммуСверхТарифа = Ложь;
	
	РаспределяемаяСумма = -ВыполненныеРаботы.Итог("Сумма");
	КоэффициентыРаспределения = Новый Массив;
	СтрокиРаспределения = Новый Массив;
	Для Каждого СтрокаТаблицы Из ЗначенияПоказателей Цикл
		Если ОтменятьИсправления Тогда
			СтрокаТаблицы.ФиксЗначение = Ложь;
		ИначеЕсли СтрокаТаблицы.ФиксЗначение Тогда
			СуммаПоТарифу = 0;
			РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Значение;
			Продолжить;
		КонецЕсли;
		СтрокиРаспределения.Добавить(СтрокаТаблицы);
		ОтработанноеВремя = ?(СтрокаТаблицы.ВремяВЧасах, СтрокаТаблицы.ОтработаноЧасов, СтрокаТаблицы.ОтработаноДней);
		КоэффициентРаспределения = 1;
		Если УчитыватьКоэффициенты Тогда
			КоэффициентРаспределения = КоэффициентРаспределения * СтрокаТаблицы.Коэффициент;
		КонецЕсли;
		Если УчитыватьТарифныеСтавки Тогда
			КоэффициентРаспределения = КоэффициентРаспределения * СтрокаТаблицы.ТарифнаяСтавка;
		КонецЕсли;
		Если УчитыватьОтработанноеВремя Тогда
			КоэффициентРаспределения = КоэффициентРаспределения * ОтработанноеВремя;
		КонецЕсли;
		КоэффициентыРаспределения.Добавить(КоэффициентРаспределения);
		Если РаспределятьСуммуСверхТарифа Тогда
			СуммаПоТарифу = СтрокаТаблицы.ТарифнаяСтавка * ОтработанноеВремя;
		КонецЕсли;
	КонецЦикла;
	
	СуммаПоТарифам = ВыполненныеРаботы.Итог("Сумма");
	РаспределяетсяСуммаСверхТарифа = РаспределятьСуммуСверхТарифа И СуммаПоТарифам > 0 И РаспределяемаяСумма > СуммаПоТарифам;
	Если РаспределяетсяСуммаСверхТарифа Тогда
		РаспределяемаяСумма = РаспределяемаяСумма - СуммаПоТарифам;
	КонецЕсли;
	
	РаспределенныеСуммы = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(Макс(РаспределяемаяСумма, 0), КоэффициентыРаспределения);
	
	Если РаспределенныеСуммы = Неопределено Тогда
		Если РаспределяемаяСумма <= 0 Тогда
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
				СтрокаРаспределения.Значение = 0;
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Индекс = 0;
	Для Каждого СтрокаТаблицы Из СтрокиРаспределения Цикл
		СтрокаТаблицы.Значение = -РаспределенныеСуммы[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры
